In [1]:
#UAP BASDAT
#DAMAR PRANA ANGGAKARA
#235091100111007
#06
#SOAL NO 3

In [2]:
# Buat koneksi dan import
import mysql.connector
conn = mysql.connector.connect(
    host='localhost',
    user='root',
    passwd='2005',
    database='product'
)
kursor1=conn.cursor()

In [3]:
#display data yang diinginkan
sql= "SELECT * FROM product.customer"
kursor1.execute(sql)
result=kursor1.fetchall()
for row in result:
    print(row)

(1, 'Alice', 'alice@example.com', '555-1234', 'New York')
(2, 'Bob', 'bob@example.com', '555-5678', 'Los Angeles')
(3, 'Charlie', 'charlie@example.com', '555-8765', 'Chicago')
(4, 'David', 'david@example.com', '555-4321', 'Houston')
(5, 'Eva', 'eva@example.com', '555-6789', 'Phoenix')
(6, 'Frank', 'frank@example.com', '555-3456', 'Philadelphia')
(7, 'Grace', 'grace@example.com', '555-6543', 'San Antonio')
(8, 'Hank', 'hank@example.com', '555-2345', 'San Diego')
(9, 'Ivy', 'ivy@example.com', '555-5432', 'Dallas')
(10, 'Jack', 'jack@example.com', '555-7890', 'San Jose')
(11, 'Kara', 'kara@example.com', '555-9876', 'Austin')
(12, 'Leo', 'leo@example.com', '555-8765', 'Jacksonville')
(13, 'Mia', 'mia@example.com', '555-7654', 'Fort Worth')
(14, 'Nina', 'nina@example.com', '555-6543', 'Columbus')
(15, 'Owen', 'owen@example.com', '555-5432', 'Charlotte')
(16, 'Paul', 'paul@example.com', '555-4321', 'San Francisco')
(17, 'Quinn', 'quinn@example.com', '555-3210', 'Indianapolis')
(18, 'Rose', 'rose@example.com', '555-2109', 'Seattle')
(19, 'Sam', 'sam@example.com', '555-1098', 'Denver')
(20, 'Tina', 'tina@example.com', '555-0987', 'Washington')

In [4]:
#display data yang diinginkan
sql= "SELECT * FROM product.productcategories"
kursor1.execute(sql)
result=kursor1.fetchall()
for row in result:
    print(row)

(1, 'Electronics', 'Devices and gadgets like laptops and tablets.')
(2, 'Mobile Devices', 'Smartphones, smartwatches, and other mobile devices.')
(3, 'Computer Accessories', 'Monitors, printers, and other accessories for computers.')
(4, 'Office Supplies', 'Keyboards, mice, USB drives, and other office supplies.')
(5, 'Audio Equipment', 'Headphones, speakers, and other audio devices.')
(6, 'Networking', 'Routers, webcams, and other networking devices.')

In [5]:
#display data yang diinginkan
sql= "SELECT * FROM product.produk"
kursor1.execute(sql)
result=kursor1.fetchall()
for row in result:
    print(row)

(1, 'Laptop', 1, 1200, 50)
(2, 'Smartphone', 2, 800, 100)
(3, 'Tablet', 1, 600, 30)
(4, 'Monitor', 3, 300, 75)
(5, 'Keyboard', 4, 50, 200)
(6, 'Mouse', 4, 25, 300)
(7, 'Printer', 3, 150, 60)
(8, 'Headphones', 5, 100, 150)
(9, 'Speaker', 5, 75, 80)
(10, 'Webcam', 6, 80, 40)
(11, 'Charger', 2, 20, 250)
(12, 'Router', 6, 120, 90)
(13, 'USB Drive', 4, 15, 500)
(14, 'External Hard Drive', 1, 100, 60)
(15, 'Projector', 3, 400, 20)
(16, 'Smartwatch', 2, 250, 70)
(17, 'Fitness Tracker', 2, 150, 80)
(18, 'Gaming Console', 1, 500, 40)
(19, 'VR Headset', 5, 200, 30)
(20, 'Drone', 6, 1000, 10)

In [6]:
#display data yang diinginkan
sql= "SELECT * FROM product.sales"
kursor1.execute(sql)
result=kursor1.fetchall()
for row in result:
    print(row)

(1, 1, 1, '1/1/2024', 1)
(2, 2, 2, '1/2/2024', 2)
(3, 3, 3, '1/3/2024', 1)
(4, 4, 4, '1/4/2024', 3)
(5, 5, 5, '1/5/2024', 5)
(6, 6, 6, '1/6/2024', 2)
(7, 7, 7, '1/7/2024', 1)
(8, 8, 8, '1/8/2024', 4)
(9, 9, 9, '1/9/2024', 2)
(10, 10, 10, '1/10/2024', 1)
(11, 11, 11, '1/11/2024', 3)
(12, 12, 12, '1/12/2024', 2)
(13, 13, 13, '1/13/2024', 5)
(14, 14, 14, '1/14/2024', 2)
(15, 15, 15, '1/15/2024', 1)
(16, 16, 16, '1/16/2024', 3)
(17, 17, 17, '1/17/2024', 2)
(18, 18, 18, '1/18/2024', 1)
(19, 19, 19, '1/19/2024', 4)
(20, 20, 20, '1/20/2024', 1)

In [7]:
#total sales
sql= "SELECT SUM(price * quantity) AS total_sales_value FROM product.sales, product.produk;"
kursor1.execute(sql)
result=kursor1.fetchall()
for row in result:
    print(row)

(Decimal('282210'),)

In [8]:
#sorting produk dengan sale tertinggi
sql = """
SELECT 
    s.sale_id, 
    (p.price * s.quantity) AS total_sale
FROM 
    product.sales s
JOIN 
    product.produk p
ON 
    s.product_id = p.product_id
ORDER BY 
    total_sale DESC;
"""
kursor1.execute(sql)
result = kursor1.fetchall()
for row in result:
    print(row)

(2, 1600)
(1, 1200)
(20, 1000)
(4, 900)
(19, 800)
(16, 750)
(3, 600)
(18, 500)
(8, 400)
(15, 400)
(17, 300)
(5, 250)
(12, 240)
(14, 200)
(7, 150)
(9, 150)
(10, 80)
(13, 75)
(11, 60)
(6, 50)